project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/write_only/expensive_read.log
bench with linearizable range
 0 / 11 B                                                                                                                                          !   0.00%INFO: 2023/06/12 13:56:42 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 13:56:42 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 13:56:42 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 11 / 11 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 10s

Summary:
  Total:	10.1305 secs.
  Slowest:	0.1589 secs.
  Fastest:	0.1297 secs.
  Average:	0.1418 secs.
  Stddev:	0.0095 secs.
  Requests/sec:	1.0858

Response time histogram:
  0.1297 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1326 [2]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1355 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1384 [0]	|
  0.1414 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1443 [2]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1472 [0]	|
  0.1501 [2]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1531 [0]	|
  0.1560 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1589 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎

Latency distribution:
  10% in 0.1316 secs.
  25% in 0.1338 secs.
  50% in 0.1425 secs.
  75% in 0.1534 secs.
  90% in 0.1589 secs.